# Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1.Establish a connection between Python and the Sakila database.

2.Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
The function should take in three parameters:

-engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.

-month: an integer representing the month for which rental data is to be retrieved.

-year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3.Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

4.Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass
password = getpass.getpass()

········

In [2]:
# 1.
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [3]:
#2. 
def rentals_month(engine, month: int, year: int) -> pd.DataFrame:
    '''
    This function retrieves rental data for a given month and year from the Sakila database as a Pandas DataFrame.
    Input: engine, month, year
    Output: Pandas DataFrame with the specific information depending on the input values
    '''
    query = f"""SELECT * 
    FROM sakila.rental 
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """
    rentals_df = pd.read_sql_query(query, engine)

    return rentals_df

In [4]:
rentals_df_july_2005 = rentals_month(engine, 7, 2005)
rentals_df_july_2005

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

In [5]:
# 3.
def rental_count_month(rentals_df: pd.DataFrame, month:int, year:int) -> pd.DataFrame:
    '''
    This function uses the rentals_df and returns a new DataFrame containing the number of rentals
    made by each customer_id during the selected month and year
    Input: rentals_df, month, year
    Output: Pandas DataFrame with the customer_id and the number of rentals depending on the input values for month/year
    '''
    rental_count = rentals_df.groupby(['customer_id']).agg({'rental_id': 'count'}).reset_index()
    rental_count.columns = ['customer_id', f"rentals_{month}_{year}"]
    return rental_count

In [6]:
rental_count_july_2005 = rental_count_month(rentals_df_july_2005, 7, 2005)
rental_count_july_2005

     customer_id  rentals_7_2005
0              1              12
1              2              14
2              3              13
3              4               5
4              5              16
..           ...             ...
594          595              19
595          596               6
596          597               7
597          598              16
598          599               7

[599 rows x 2 columns]

In [ ]:
#SELECT customer_id, COUNT(rental_id) AS num_of_rentals
#FROM sakila.rental 
#WHERE MONTH(rental_date) = 6 AND YEAR(rental_date) = 2005
#GROUP BY customer_id
#ORDER BY num_of_rentals DESC;

In [19]:
# 4.
def compare_rentals(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    
    merged_df = pd.merge(df1, df2, on = 'customer_id', how = 'outer', suffixes = ('_df1', '_df2'))
    merged_df['difference'] = merged_df.iloc[:, 2].fillna(0) - merged_df.iloc[:, 1].fillna(0)
    return merged_df

In [20]:
rentals_df_august_2005 = rentals_month(engine, 8, 2005)
rental_count_august_2005 = rental_count_month(rentals_df_august_2005, 8, 2005)
rental_count_august_2005

     customer_id  rentals_8_2005
0              1              11
1              2              11
2              3               7
3              4              11
4              5              13
..           ...             ...
594          595               8
595          596              13
596          597              12
597          598               5
598          599               7

[599 rows x 2 columns]

In [21]:
diff_aug_july = compare_rentals(rental_count_july_2005, rental_count_august_2005)
diff_aug_july

     customer_id  rentals_7_2005  rentals_8_2005  difference
0              1              12              11          -1
1              2              14              11          -3
2              3              13               7          -6
3              4               5              11           6
4              5              16              13          -3
..           ...             ...             ...         ...
594          595              19               8         -11
595          596               6              13           7
596          597               7              12           5
597          598              16               5         -11
598          599               7               7           0

[599 rows x 4 columns]